cases/RKF45GDHFoam/pitzDaily/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
12225
(
0.335211
0.299858
0.270197
0.245817
0.226177
0.210686
0.198767
0.189897
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
223
(
0.337557
0.3051
0.278452
0.256295
0.237732
0.222108
0.208916
0.197753
...
)
;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
250
(
0.335211
0.299858
0.270197
0.245817
0.226177
0.210686
0.198767
0.189897
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
